


<p><a id="Picard2006"></a>

Picard, G. and Glize, P. (2006).
 Model and Analysis of Local Decision Based on Cooperative
  Self-Organization for Problem Solving.
[&nbsp;<a href="publications/2006_bib.html#Picard2006">bib</a>&nbsp;]
<blockquote><font size="-1">
This paper presents an approach based on cooperative self-organization for artificial systems, in order to tackle openness and dynamics. In this work, cooperation is used as a local criterion enabling parts of the system - the cooperative agents - to reorganize as to autonomously modify their interactions and then the global function. The difficulty in defining cooperation and the means to reestablish a cooperative state within a non cooperative system are underlined and analyzed. Two cooperative agents' behaviors are expounded, at the boundary between altruism and selfishness. This approach is also illustrated by modeling, from a local viewpoint, a classical constraint satisfaction or optimization problems.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: csp; self-organisation
</font></blockquote>

</p>

<p><a id="Ottens2006"></a>

Ottens, K., Picard, G., and Camps, V. (2006).
 Transformation de mod&egrave;les d'agents dans la m&eacute;thode ADELFE :
  Des st&eacute;r&eacute;otypes de conception &agrave; l'impl&eacute;mentation.
[&nbsp;<a href="publications/2006_bib.html#Ottens2006">bib</a>&nbsp;]
<blockquote><font size="-1">
Dans cet article, nous pr&eacute;sentons un mod&egrave;le d'agent coop&eacute;ratif utilis&eacute; dans la m&eacute;thode ADELFE pour la conception de syst&egrave;mes multi-agents adaptatifs. Cette m&eacute;thode repose sur un processus (Rational unified process) ainsi que des notations (UML et AUML) issus de l'analyse et de la conception objet et agent. Concernant l'aspect statique de conception, les agents sont d&eacute;crits en tant que classes dont la structure est contrainte par l'usage de st&eacute;r&eacute;otypes ayant une s&eacute;mantique forte d'accessibilit&eacute; sur les diff&eacute;rents modules composant un agent coop&eacute;ratif. Les aspects dynamiques, et plus particuli&egrave;rement les protocoles de communication entre agents, sont sp&eacute;cifi&eacute;s gr&acirc;ce aux diagrammes de protocoles AUML. Le mod&egrave;le fonctionnel et structurel ainsi obtenu peut ais&eacute;ment conduire &agrave; la g&eacute;n&eacute;ration de code, et ainsi permettre de passer de la conception &agrave; l'impl&eacute;mentation, comme propos&eacute; dans le cadre de l'ing&eacute;nierie des mod&egrave;les, ou MDA (model driven architecture).
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="Picard2006a"></a>

Picard, G. and Gleizes, M.-P. (2006).
 Auto-organisation coop&eacute;rative pour la conception de collectifs
  adaptatifs et robustes.
 In <em>7&egrave;me Congr&egrave;s de la Soci&eacute;t&eacute; Fran&ccedil;aise de
  Recherche Op&eacute;rationnelle et d'Aide &agrave; la D&eacute;cision (ROADEF'06), 6,
  7 et 8 F&eacute;vrier 2006, Lille, France</em>.
[&nbsp;<a href="publications/2006_bib.html#Picard2006a">bib</a>&nbsp;]
<blockquote><font size="-1">
Cet article propose un mod&egrave;le d'agent coop&eacute;ratif et souligne les b&eacute;n&eacute;fices de l'usage de la coop&eacute;ration comme un moteur d'adaptation et de robustesse pour des syst&egrave;mes multi-agents. Notre travail est bas&eacute; sur l'approche des syst&egrave;mes multi-agents adaptatifs (AMAS) qui consid&egrave;re la coop&eacute;ration comme un m&eacute;canisme auto-organisateur pour obtenir des comportements globaux &eacute;mergents pour des syst&egrave;mes plon- g&eacute;s dans des environnements dynamiques. Une t&acirc;che de transport de ressources multi-robot illustre l'instanciation du mod&egrave;le d'agent coop&eacute;ratif dot&eacute; de r&egrave;gles comportementales r&eacute;actives et anticipatives pour la coop&eacute;ration. Plusieurs exp&eacute;rimentations montrent la pertinence de cette approche dans des environnements diffciles, statiques ou dynamiques.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: collective robotics; self-organisation
</font></blockquote>

</p>

<p><a id="Bernon2006"></a>

Bernon, C., Gleizes, M.-P., and Picard, G. (2006).
 Enhancing Self-Organising Emergent Systems Design with Simulation.
 In <em>Seventh International Workshop on Engineering Societies in
  the Agents World (ESAW'06), Dublin, Ireland from the 6th - 8th September,
  2006</em>.
[&nbsp;<a href="publications/2006_bib.html#Bernon2006">bib</a>&nbsp;]
<blockquote><font size="-1">
A defining characteristic of Open Computational Societies is the unpredictable behaviour of their participants, resulting from their operational and architectural heterogeneity. This has led to the development of computational frameworks that facilitate the declaration of agent specifications in terms of normative relations. The frameworks offer modelling, simulation and validation, but typically have not supported dynamic modification of the specification at runtime by the agents themselves. This omission can be a limitation in certain scenarios, where agents might be capable of adaptation when faced with unexpected stimuli, but the specifications under which they operate did not allow for it. In this paper we extend an existing normative computational framework to facilitate well-defined dynamic normative modification of a specification by the agents themselves, given a well-defined meta-specification. We complement the framework with a mathematical model of the `specification space'. We argue that the introduced dynamism preserves several of the advantages of static normative frameworks while allowing for more flexible, highly autonomous systems, simpler specification authoring and generic protocol reuse.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose; self-organisation
</font></blockquote>

</p>