


<p><a id="picard07fapp"></a>

Picard, G., Gleizes, M.-P., and Glize, P. (2007b).
 Distributed Frequency Assignment Using Cooperative
  Self-Organization.
 In <em>First IEEE International Conference on Self-Adaptive and
  Self-Organizing Systems (SASO'07), Boston, Mass., USA, July 9-11, 2007</em>,
  pages 183--192. IEEE Computer Society.
[&nbsp;<a href="publications/2007_bib.html#picard07fapp">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1109/SASO.2007.18">DOI</a>&nbsp;| 
<a href="http://ieeexplore.ieee.org/xpl/articleDetails.jsp?arnumber=4274902">http</a>&nbsp;]
<blockquote><font size="-1">
This paper presents an approach using self-organizing multi-agent systems to solve distributed constraint satisfaction problems (DCSP), which concerns distribution among agents which task is to assign personal variables to values with respect with known constraints. Agents only know their variables and the constraints affecting them, and have to negotiate to find a collective solution. The proposed approach defines cooperative self-organization as the process leading the collective to the solution: agents can change the organization by their own decision to improve the state of the system. This work is illustrated on distributed frequency assignment, a classical constraint-based problem.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: csp; self-organisation
</font></blockquote>

</p>

<p><a id="picard07jfsma"></a>

Picard, G., Gleizes, M.-P., and Glize, P. (2007a).
 Affectation distribu&eacute;e de fr&eacute;quences par auto-organisation
  coop&eacute;rative.
 In <em>Journ&eacute;es Francophones sur les Syst&egrave;mes Multi-Agents
  (JFSMA'07), Carcassonne, France, Octobre 17-19</em>, pages 33--42.
  C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2007_bib.html#picard07jfsma">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/picard07jfsma.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Cet article pr&eacute;sente une approche pour r&eacute;soudre des probl&egrave;mes de satisfaction de contraintes distribu&eacute;s (DCSP) par des syst&egrave;mes multi-agents auto-organisateurs. Les DCSP consid&egrave;rent la distribution parmi des agents coop&eacute;ratifs dont la t&acirc;che est d'affecter une variable propre en respectant des contraintes connues et en n&eacute;gociant pour trouver une solution collective. L' approche	propos&eacute;e	d&eacute;finit l'auto-organisation coop&eacute;rative comme le processus guidant le collectif vers la solution : les agents, suivant un mod&egrave;le comportemental coop&eacute;ratif, changent leur organisation pour am&eacute;liorer l'&eacute;tat courant du syst&egrave;me. Ce travail est illustr&eacute; par un probl&egrave;me d' affectation distribu&eacute;e de fr&eacute;quences, un probl&egrave;me classique de mod&eacute;lisation sous contraintes.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: csp; self-organisation
</font></blockquote>

</p>