


<p><a id="gleizes08glis"></a>

Gleizes, M.-P., Bernon, C., Migeon, F., and Picard, G. (2008).
 M&eacute;thodes de d&eacute;veloppement de syst&egrave;mes multi-agents.
 <em>G&eacute;nie Logiciel, GL &amp; IS</em>, 86:2--7.
[&nbsp;<a href="publications/2008_bib.html#gleizes08glis">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/gleizes08glis.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Les syst&egrave;mes multi-agents (SMA) ont montr&eacute; leur pertinence pour la conception d'applications dis- tribu&eacute;es (logiquement ou physiquement), complexes et robustes. Le concept d'agent est aujourd'hui plus qu'une technologie efficace, il repr&eacute;sente un nouveau paradigme pour le d&eacute;veloppement de logiciels dans lesquels l'agent est un logiciel autonome qui poss&egrave;de un objectif, &eacute;volue dans un environnement dynamique et interagit avec d'autres agents au moyen de langages et de protocoles. Souvent, l'agent est consid&eacute;r&eacute; comme un objet "intelligent" ou comme un niveau d'abstraction au-dessus des objets et des composants. Les m&eacute;thodes de d&eacute;velop- pement orient&eacute;es objet -- au vu des diff&eacute;rences entre les objets et les agents -- ne sont pas directement applicables au d&eacute;veloppement de SMA. Il est alors devenu n&eacute;cessaire d'&eacute;tendre ou de d&eacute;velopper de nouveaux mod&egrave;les, de nouvelles m&eacute;thodes et de nouveaux outils adapt&eacute;s au d&eacute;veloppement de syst&egrave;mes multi-agents. L'objectif de cet article est d'&eacute;tablir la sp&eacute;cificit&eacute; du paradigme multi-agent, de donner un aper&ccedil;u du processus de d&eacute;veloppement d'un SMA au travers de la m&eacute;thode ADELFE et de donner les caract&eacute;ristiques des principales m&eacute;thodes de conception de SMA en donnant les caract&eacute;ristiques essentielles de chacune.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="esaw08"></a>

Artikis, A., Picard, G., and Vercouter, L., editors (2008).
 <em>Engineering Societies in the Agents World IX - 9th International
  Workshop, ESAW 2008, Saint-Etienne, France, September 24-26, 2008, Revised
  Selected Papers</em>, volume 5485 of <em>Lecture Notes in Artificial
  Intelligence (LNAI)</em>.
 Springer.
[&nbsp;<a href="publications/2008_bib.html#esaw08">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1007/978-3-642-02562-4">DOI</a>&nbsp;| 
<a href="http://www.springer.com/computer/ai/book/978-3-642-02561-7">http</a>&nbsp;]
<blockquote><font size="-1">
This book constitutes the thoroughly refereed post-conference proceedings of the 9th International Workshop on Engineering Societies in the Agents World, ESAW 2008, held in Saint-Etienne, France, in September 2008.<p>
The 13 revised full papers presented together with 1 invited long paper were carefully selected from 29 submissions during two rounds of reviewing and revision. The papers are organized in topical sections on organisations and norm-governed systems, privacy and security, agent-oriented software engineering, emergence and self-organisation, as well as simulation.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="clair08masc"></a>

Clair, G., Gleizes, M.-P., Kaddoum, E., and Picard, G. (2008b).
 Self-Regulation in Self-Organising Multi-Agent Systems for Adaptive
  and Intelligent Manufacturing Control.
 In <em>Second IEEE International Conference on Self-Adaption and
  Self-Organization (SASO 2008), Venice, Italy, 20-24 October 2008</em>,
  pages 107--116. IEEE Computer Society.
[&nbsp;<a href="publications/2008_bib.html#clair08masc">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1109/SASO.2008.19">DOI</a>&nbsp;| 
<a href="http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=4663415">http</a>&nbsp;]
<blockquote><font size="-1">
In this paper, we explore the potential of distributed satisfaction techniques as to provide self-regulated manufacturing control. This work relies on a DisCSP-based modeling distributed among agents (e.g. machines) having enough and reasoning capabilities to cooperate and negotiate for a committed schedule. This approach is used to dynamically regulate the system (the network of machines) when perturbations occur (machine break-out, operator or container unavailability, or even priority command). Thus, for these machines, embodied intelligence and autonomy are a mean to provide a more flexible and adaptive manufacturing network. In this paper, we present two different multi-agent models and two extensions of well-known DisCSP solvers. Experiments using a dedicated simulation platform, MASC, are presented and discussed.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: csp; self-organisation
</font></blockquote>

</p>

<p><a id="picard08jfsma"></a>

Clair, G., Gleizes, M.-P., Kaddoum, E., and Picard, G. (2008a).
 Approches multi-agents auto-organisatrices pour un contr&ocirc;le
  manufacturier intelligent et adaptatif.
 In <em>Journ&eacute;es Francophones sur les Syst&egrave;mes Multi-Agents
  (JFSMA'08), Brest, France, Octobre 15-17</em>, pages 191--200. C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2008_bib.html#picard08jfsma">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/picard08jfsma.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Dans cet article, nous explorons le potentiel des techniques de satisfaction de contraintes distribu&eacute;es afin de proposer une solution pour l'autor&eacute;gulation du contr&ocirc;le manufacturier. Ce travail repose sur une mod&eacute;lisation DisCSP impliquant un ensemble d'agents (e.g. les stations) ayant des capacit&eacute;s suffisantes de communication et de raisonnement pour coop&eacute;rer et n&eacute;gocier un accord sur une organisation du travail. Cette approche est utilis&eacute;e pour r&eacute;guler dynamiquement le syst&egrave;me lorsque des perturbations surviennent (panne, indisponibilit&eacute; d'op&eacute;rateurs ou commande exceptionnelle prioritaire). Ainsi, pour ces machines, l'autonomie et l'intelligence distribu&eacute;e sont un moyen de fournir un contr&ocirc;le manufacturier plus flexible. Des r&eacute;sultats d'exp&eacute;rimentations sur la plate-forme MASC sont pr&eacute;sent&eacute;s pour comparer cette approche aux techniques de r&eacute;solution de DisCSP classiques.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: self-organisation; csp
</font></blockquote>

</p>

<p><a id="hubner08dagstuhl"></a>

H&uuml;bner, J.&nbsp;F., Bordini, R.&nbsp;H., and Picard, G. (2008a).
 Jason and MOISE+: Organisational programming in the Agent Contest
  2008.
 In Bordini, R., Dastani, M., Dix, J., and El&nbsp;Fallah-Seghrouchni, A.,
  editors, <em>Dagstuhl Seminar on Programming Multi-Agent Systems</em>, volume
  08361.
[&nbsp;<a href="publications/2008_bib.html#hubner08dagstuhl">bib</a>&nbsp;| 
<a href="http://www.das.ufsc.br/~jomi/pubs/2008/JMoise-team-ac2008-slides.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="hubner08ac"></a>

H&uuml;bner, J.&nbsp;F., Bordini, R.&nbsp;H., and Picard, G. (2008b).
 Using jason and MOISE+ to develop a team of cowboys.
 In Hindriks, K., Pokahr, A., and Sardina, S., editors, <em>
  Proceedings of the Seventh international Workshop on Programming Multi-Agent
  Systems (ProMAS 08), Agent Contest, held with The Seventh International Joint
  Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2008)</em>, pages
  238--242.
[&nbsp;<a href="publications/2008_bib.html#hubner08ac">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1007/978-3-642-03278-3">DOI</a>&nbsp;| 
<a href="http://www.springerlink.com/content/t402t436636r/#section=185314&amp;amp;page=1&amp;amp;locus=0">http</a>&nbsp;]
<blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="garcia08amicrim"></a>

Garcia&nbsp;Ruiz, J.&nbsp;E., Georg&eacute;, J.-P., and Picard, G. (2008).
 The AmICriM Project: A Truly Body Area Network Application.
 In <em>First International Workshop on Sensor Networks (SN 2008),
  in conjunction with ICCCN 2008, August 4-7, Virgin Islands, USA</em>.
[&nbsp;<a href="publications/2008_bib.html#garcia08amicrim">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/garcia08amicrim.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
The major aim of this work is to present the AmICriM (Ambient Intelligence for Crisis Management) current activities as an upcoming research challenge in the area of body area networking by using intelligent embodied devices for supporting new crisis management services. The research outcomes of the AmICriM project will show also future directions in the area of body-area networks and communications, as well as its applications to novel approaches in which firemen would receive critical and valuable information when acting in real situations of crisis, as in case of fire in a building.
This work will boost development of new technologies and solutions that will be used in the future for networking embodied intelligent devices. Moreover, the AmICriM developed technologies will be evaluated through a real service for assisting firemen in crisis situations.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: ambient intelligence
</font></blockquote>

</p>