


<p><a id="Aldewereld2009"></a>

(2009).
 <em>Engineering Societies in the Agents World X - 10th International
  Workshop, ESAW 2009, Utrecht, The Netherlands, November 18-20, 2009</em>.
[&nbsp;<a href="publications/2009_bib.html#Aldewereld2009">bib</a>&nbsp;]
<blockquote><font size="-1">
This book constitutes the refereed proceedings of the 10th International Workshop on Engineering Societies in the Agents World, ESAW 2009, held in Utrecht, The Netherlands, in November 2009.<p>
The 13 revised full papers and 5 short contributions presented together with two invited talks were carefully selected from 31 submissions. The papers are organized in topical sections on self-organization, software-engineering and architectures, social aspects of agent societies, organization and autonomy. This proceedings concludes with the extended abstracts of 6 contributions to a demonstration session on agent-based technologies and works.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="Bernon2009"></a>

Bernon, C., Gleizes, M.-P., and Picard, G. (2009).
 M&eacute;thodes orient&eacute;es agent et multi-agent.
 In <em>Technologies des syst&egrave;mes multi-agents et applications
  industrielles</em>.
[&nbsp;<a href="publications/2009_bib.html#Bernon2009">bib</a>&nbsp;]
<blockquote><font size="-1">
L'objectif de ce chapitre est de donner un panorama des principales m&eacute;thodes de conception de SMA et de la standardisation des techniques dans ce domaine. Les m&eacute;thodes seront d&eacute;crites en suivant un m&ecirc;me plan pour faciliter leur comparaison. Des prospectives &agrave; court, moyen et long termes seront ensuite exprim&eacute;es avant de conclure ce chapitre.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose
</font></blockquote>

</p>

<p><a id="Kaddoum2009"></a>

Kaddoum, E., Gleizes, M.-P., Georg&eacute;, J.-P., Glize, P., and Picard, G.
  (2009a).
 Analyse des crit&egrave;res d'&eacute;valuation de syst&egrave;mes
  multi-agents adaptatifs.
 In <em>Journ&eacute;es Francophones sur les Syst&egrave;mes Multi-Agents
  (JFSMA'09), Lyon, France, October 19-21</em>.
[&nbsp;<a href="publications/2009_bib.html#Kaddoum2009">bib</a>&nbsp;]
<blockquote><font size="-1">
La complexit&eacute; croissante des applications actuelles favorise le d&eacute;veloppement de syst&egrave;mes multi-agents auto-organisateurs poss&eacute;dant des propri&eacute;t&eacute;s self-*. Ces syst&egrave;mes autonomes pr&eacute;sentent des capacit&eacute;s int&eacute;ressantes permettant la gestion de la dynamique endog&egrave;ne et exog&egrave;ne des applications &eacute;tudi&eacute;es.
De nouveaux crit&egrave;res doivent &ecirc;tre &eacute;tudi&eacute;s afin de caract&eacute;riser et &eacute;valuer l'apport de ces propri&eacute;t&eacute;s self-* et leur influence sur les performances du syst&egrave;me. Dans cet article, diff&eacute;rentes cat&eacute;gories regroupant les principaux crit&egrave;res d'&eacute;valuation sont d&eacute;crites afin de guider l'&eacute;valuation de ce type de syst&egrave;mes depuis les phases de conception jusqu'aux phases d'ex&eacute;cution : &eacute;valuation du syst&egrave;me en cours de fonctionnement, caract&eacute;ristiques intrins&egrave;ques et m&eacute;thodologie de conception.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: self-organisation
</font></blockquote>

</p>

<p><a id="Picard2009"></a>

Picard, G., H&uuml;bner, J.&nbsp;F., Boissier, O., and Gleizes, M.-P. (2009b).
 R&eacute;organisation et auto-organisation dans les syst&egrave;mes
  multi-agents.
 In <em>Journ&eacute;es Francophones sur les Syst&egrave;mes Multi-Agents
  (JFSMA'09), Lyon, France, October 19-21</em>.
[&nbsp;<a href="publications/2009_bib.html#Picard2009">bib</a>&nbsp;]
<blockquote><font size="-1">
R&eacute;cemment, les aspects sociaux et organisationnels sont devenus des sujets de recherche majeurs en syst&egrave;mes multi-agents (SMA). Les travaux conduits peuvent &ecirc;tre d&eacute;clin&eacute;s suivant un point de vue centr&eacute; agent (ACPV) et un point de vue centr&eacute; organisation (OCPV), dans lesquels la notion centrale de dynamique des organisations est consid&eacute;r&eacute;e. Dans ACPV, cette notion correspond &agrave; des ph&eacute;nom&egrave;nes ascendants et &eacute;mergents qui sont regroup&eacute;s sous le terme g&eacute;n&eacute;ral d'auto-organisation. Dans OCPV, cette notion d'organisation nourrit un large panel de travaux relatifs &agrave; la r&eacute;organisation formelle et descendante d'organisations pr&eacute;existantes install&eacute;es dans le SMA. Dans cet article, nous proposons de positionner ces approches afin de construire une vision synth&eacute;tique de la dynamique des organisations dans les SMA.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose; self-organisation, re-organisation
</font></blockquote>

</p>

<p><a id="Kaddoum2009a"></a>

Kaddoum, E., Gleizes, M.-P., Georg&eacute;, J.-P., and Picard, G. (2009b).
 Characterizing and evaluating problem solving self-* systems.
 In <em>International Conference on Adaptive and Self-adaptive
  Systems and Applications (ADAPTIVE 2009), 2009 Computation World: Future
  Computing, Service Computation, Cognitive, Adaptive, Content, Patterns,
  Athens, Greece, November 15-November 20</em>.
[&nbsp;<a href="publications/2009_bib.html#Kaddoum2009a">bib</a>&nbsp;]
<blockquote><font size="-1">
In the last few years, the growing complexity of current applications has led to the design of self-organizing systems presenting self-* properties. Those systems are composed of several autonomous interactive entities. They behave autonomously and present interesting characteristics allowing them to handle dynamics coming from exogenous and endogenous changes. As those systems are different from classical ones, new or updated characterization and evaluation criteria are required for analyzing the contribution of self-* properties and system performance.This work is a first step for evaluating self-* systems. Its main purpose is to propose a simulation based evaluation framework which aims at guiding the evaluation of this kind of systems from the design phase all the way to the execution results: evaluation of the system at run-time, intrinsic and development methodologies characterization.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: self-organisation
</font></blockquote>

</p>

<p><a id="Picard2009a"></a>

Picard, G., H&uuml;bner, J.&nbsp;F., Boissier, O., and Gleizes, M.-P. (2009a).
 Reorganisation and self-organisation in multi-agent systems.
 In <em>International Workshop on Organizational Modeling
  (OrgMod'09)</em>.
[&nbsp;<a href="publications/2009_bib.html#Picard2009a">bib</a>&nbsp;]
<blockquote><font size="-1">
In the last years, social and organisational aspects of agency have become a major issue in multi-agent systems' research.  The conducted works may be structured along two main points of view: an agent-centred point of view (ACPV) and an organisation-centred point of view (OCPV).  In both approaches the central notion of multi-agent organisation dynamic is considered.  In ACPV, this notion leads to a kind of informal, bottom-up, emergent phenomena that we regroup under the general term of self-organisation. In OCPV, this notion gives birth to a huge set of works related to the reorganisation of the formal, top-down, pre-existent organisations that are installed in the MAS.  In this paper, we propose to position these two approaches to build a comprehensive picture of organisation dynamic in multi-agent systems.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: self-organisation; aose, re-organisation
</font></blockquote>

</p>