


<p><a id="persson11eumas"></a>

Persson, C., Picard, G., Ramparany, F., and Boissier, O. (2011b).
 A multi-agent organization for the governance of machine-to-machine
  systems.
 In <em>European Workshop on Multi-agent Systems (EUMAS'11)</em>.
[&nbsp;<a href="publications/2011_bib.html#persson11eumas">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/persson11eumas.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Keywords: ambient intelligence, aose, re-organisation
</font></blockquote>

</p>

<p><a id="yaich11eumas"></a>

Yaich, R., Boissier, O., Picard, G., and Jaillon, P. (2011b).
 Social-compliance in trust management within virtual communities.
 In <em>European Workshop on Multi-agent Systems (EUMAS'11)</em>.
[&nbsp;<a href="publications/2011_bib.html#yaich11eumas">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/yaich11eumas.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Keywords: trust, self-organisation
</font></blockquote>

</p>

<p><a id="sorici11agere"></a>

Sorici, A., Boissier, O., Picard, G., and Santi, A. (2011).
 Exploiting the jacamo framework for realising an adaptive room
  management application.
 In <em>AGERE! (Actors and aGEnts REloaded) Programming Systems,
  Languages, and Applications based on Actors, Agents, and Decentralized
  Control workshop at ACM SPLASH 2011</em>, pages 239--242. ACM Press.
[&nbsp;<a href="publications/2011_bib.html#sorici11agere">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1145/2095050.2095088">DOI</a>&nbsp;| 
<a href="http://doi.acm.org/10.1145/2095050.2095088">http</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/sorici11agere.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Ambient Intelligent (AmI) applications are often meant to be used in complex and highly dynamic environments and are characterized by features such as context-awareness, personalization, adaptivity and anticipation of user's desires. 
In this demo we focus on how the use of the high level of abstraction provided by multi agent-oriented technologies and related programming languages -- and in particular of the ones rooted on a strong notion of agency -- can ease the conceiving and realisation of AmI applications exhibiting such features.
For doing this we present here an agile governance application, realised using the Jacamo framework, for the dynamic management and allocation of rooms in the context of a smart co-working space.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: ambient intelligence, aose, re-organisation, self-organisation
</font></blockquote>

</p>

<p><a id="everaere11jfsma"></a>

Everaere, P., Morge, M., and Picard, G. (2011).
 Casanova : un comportement d'agent pour l'&eacute;quit&eacute; des mariages
  pr&eacute;servant la privacit&eacute;.
 In <em>19es Journ&eacute;es francophones des syst&egrave;mes multi-agents
  (JFSMA'11)</em>, pages 203--212. C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2011_bib.html#everaere11jfsma">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/morge11jfsma.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Cet article pr&ocirc;ne une approche orient&eacute;e individu pour la r&eacute;solution du probl&egrave;me classique des mariages stables. Selon cette approche, la solution &eacute;merge des n&eacute;gociations entre agents. Par exemple, l'algorithme de Gale-Shapley (GS) distinguent deux comportements d'agents (proposant et disposant) qui n&eacute;gocient pour aboutir &agrave; une solution stable, pareto-otpimale mais in&eacute;quitable : la communaut&eacute; des proposants est
favoris&eacute;e. Nous proposons ici l'algorithme Casanova qui met en oeuvre une strat&eacute;gie de concession minimale. Les agents jouent simultan&eacute;ment le r&ocirc;le de disposant et de proposant dans une multitude de n&eacute;gociations bilat&eacute;rales. De plus, les solutions qui &eacute;mergent ne peuvent &ecirc;tre atteintes par GS et elles sont plus &eacute;quitables. Notre impl&eacute;mentation est d&eacute;centralis&eacute;e et pr&eacute;serve la privacit&eacute;.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: social welfare; stable matching; privacy
</font></blockquote>

</p>

<p><a id="yaich11jfsma"></a>

Yaich, R., Jaillon, P., Boissier, O., and Picard, G. (2011c).
 Gestion de la confiance et int&eacute;gration des exigences sociales au
  sein de communaut&eacute;s virtuelles.
 In <em>19es Journ&eacute;es francophones des syst&egrave;mes multi-agents
  (JFSMA'11)</em>, pages 213--222. C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2011_bib.html#yaich11jfsma">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/yaich11jfsma.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
La confiance est devenue un facteur cl&eacute; des processus de d&eacute;cision au sein de communaut&eacute;s virtuelles. La d&eacute;centralisation et l'ouverture inh&eacute;rentes &agrave; de tels environnements sont sources de nouveaux d&eacute;fis qui ne sont pas encore relev&eacute;s par les approches actuelles. Dans cet article, nous pr&eacute;sentons comment les politiques de confiances des utilisateurs et des communaut&eacute;s peuvent &ecirc;tre consid&eacute;r&eacute;es, g&eacute;r&eacute;es et combin&eacute;es. Pour ce, nous proposons un syst&egrave;me de gestion de la confiance adaptatif, bas&eacute; sur la technologie multi-agent, qui int&egrave;gre les exigences sociales des communaut&eacute;s : SC-TMS. Dans ce syst&egrave;me, les politiques de confiance peuvent &ecirc;tre utilis&eacute;es pour sp&eacute;cifier des mod&egrave;les de confiance centr&eacute;s utilisateur et centr&eacute;s communaut&eacute; et les agents y sont utilis&eacute;s pour g&eacute;rer et combiner ces diff&eacute;rentes politiques de mani&egrave;re flexible et d&eacute;- centralis&eacute;e. Nous d&eacute;crivons les fonctionnalit&eacute;s et l'architecture qui les mettent en &oelig;uvre et discutons de l'impl&eacute;mentation.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose, trust
</font></blockquote>

</p>

<p><a id="persson11jfsma"></a>

Persson, C., Picard, G., Ramparany, F., and Boissier, O. (2011c).
 Organisation multi-agent pour la gouvernance de syst&egrave;mes
  machine-to-machine.
 In <em>19es Journ&eacute;es francophones des syst&egrave;mes multi-agents
  (JFSMA'11)</em>, pages 11--20. C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2011_bib.html#persson11jfsma">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/persson11jfsma.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Le paradigme Machine-to-Machine (M2M) implique des appareils (capteurs, effecteurs) interagissant pour fournir des services localis&eacute;s dans le monde physique. Avec la maturit&eacute; du M2M, une demande grandissante pour des solutions mutualis&eacute;es dans lesquelles les
applications peuvent partager un ensemble commun d'appareils &eacute;merge. Dans ce contexte, le projet Senscity propose une infrastructure pour mettre en oeuvre des applications &agrave; l'&eacute;chelle de la ville, ce qui n&eacute;cessite de fournir des moyens de gouvernance agile pour prendre en compte l'extensibilit&eacute; du syst&egrave;me (ie. scalability). Par ailleurs, les technologies multi-agents apportent adaptation, flexibilit&eacute; et proactivit&eacute; dans un cadre
d&eacute;centralis&eacute;. Ainsi, nous proposons une organisation multi-agent pour exprimer la strat&eacute;gie de gouvernance de syst&egrave;mes M2M. Gr&acirc;ce au cadre de mod&eacute;lisation organisationnelle MOISE, nous illustrons comment mettre en oeuvre un SMA pour la gestion intelligente du stationnement.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: ambient intelligence, aose, re-organisation
</font></blockquote>

</p>

<p><a id="yaich11wic"></a>

Yaich, R., Boissier, O., Jaillon, P., and Picard, G. (2011a).
 Social-compliance in trust management within virtual communities.
 In <em>3rd International Workshop on Web Intelligence and
  Communities (WI&amp;C'11) at the International Conferences on Web Intelligence
  and Intelligent Agent Technology (WI-IAT 2011)</em>, pages 322--325. IEEE
  Computer Society.
[&nbsp;<a href="publications/2011_bib.html#yaich11wic">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1109/WI-IAT.2011.212">DOI</a>&nbsp;| 
<a href="http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;amp;arnumber=6040870">http</a>&nbsp;]
<blockquote><font size="-1">
Recently, trust became a key factor in the decision process within virtual communities. The inherent decentral- ization and openness of such environments produced new challenges that are not solved by current approaches. In this paper we are considering how user-centred and community- centred trust policies can be considered, managed and com- bined. To this aim, we propose an adaptive Socially-Compliant Trust Management Systems (SC-TMS) based on multi-agent technologies. In this framework, trust policies can be used to specify (i) user-centred and (ii) community-centred trust models. Agents are used to manage and combine these different policies in a decentralized and flexible way. We describe the functionalities and the architecture that supports them and discuss also a prototype implementation.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: aose, trust
</font></blockquote>

</p>

<p><a id="persson11iat"></a>

Persson, C., Picard, G., and Ramparany, F. (2011a).
 A multi-agent organization for the governance of machine-to-machine
  systems.
 In <em>IEEE/WIC/ACM International Conference on Intelligent Agent
  Technology (IAT'11)</em>, pages 421--424. IEEE Computer Society.
[&nbsp;<a href="publications/2011_bib.html#persson11iat">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1109/WI-IAT.2011.161">DOI</a>&nbsp;| 
<a href="http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&amp;amp;arnumber=6040668">http</a>&nbsp;]
<blockquote><font size="-1">
The Machine-to-Machine (M2M) paradigm involves devices (sensors, actuators) interacting together to provide ser- vices located in the real world. The Senscity project proposes an infrastructure to enable shared city scale applications --ie. smart cities. Implementing such an infrastructure raises the problem of providing an agile governance with respect to scalability. Multi- Agent technologies grant adaptability, flexibility and proactivity properties. This paper investigates how they can suit to our problem. It proposes a Multi-Agent organization for expressing the governance strategy of such systems. Using the MOISE Organization framework, it is illustrated within a smart parking management application.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: ambient intelligence, aose, re-organisation
</font></blockquote>

</p>

<p><a id="villanueva11idetc"></a>

Villanueva, D., Le&nbsp;Riche, R., Picard, G., Haftka, R.&nbsp;T., and Sankar, B.&nbsp;V.
  (2011b).
 Decomposition of system level reliability-based design optimization
  to reduce the number of simulations.
 In <em>ASME 2011 International Design Engineering Technical
  Conferences &amp; Computers and Information in Engineering Conference,
  Washington, DC, USA</em>, pages 117--126. ASME.
[&nbsp;<a href="publications/2011_bib.html#villanueva11idetc">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1115/DETC2011-47815">DOI</a>&nbsp;| 
<a href="http://dl.dropbox.com/u/473092/Villanueva_IDETC_2011.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
It is computationally expensive to evaluate the overall sys- tem level reliability when several interacting failure modes are present. Therefore, it is even more expensive to optimize con- sidering the system level reliability that accounts for the inter- actions between failure modes. In this paper, we decompose the system level reliability based optimization problem using surro- gates into less expensive problems with fixed risk allocation for each failure mode. In addition, the fixed risk allocation problem is transformed from a purely probabilistic problem to a determin- istic one through an iterative process of updating safety factors to limit the number of calls to evaluate the reliability. We found that the number of calls to the simulation to evaluate the system level reliability was reduced by 77% with this methodology.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: multi-disciplinary optimization
</font></blockquote>

</p>

<p><a id="picard11sobook"></a>

Glize, P. and Picard, G. (2011).
 Self-organisation in constraint problem solving.
 In Serugendo, G., Gleizes, M.-P., and Karageorgos, A., editors, <em>
  Self-organizing Software: From Natural to Artificial Adaptation</em>, Natural
  Computing Series, chapter&nbsp;14, pages 347--377. Springer.
[&nbsp;<a href="publications/2011_bib.html#picard11sobook">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1007/978-3-642-17348-6_14">DOI</a>&nbsp;| 
<a href="http://www.springer.com/computer/ai/book/978-3-642-17347-9">http</a>&nbsp;]
<blockquote><font size="-1">
Constraint satisfaction (CSP) or constraint optimisation problems (COP) frameworks are well-known, and well-addressed using classical methods coming from operations research and artificial intelligence. Nevertheless, when dynamics and distribution are added requirements, those approaches do not necessarily fit or need serious re-factoring to be efficient. The idea beneath this chapter is to exploit the intrinsic distributed and adaptive nature of self-organising systems to cooperatively solve distributed constraint based problems, in which constraints and variables can change at run-time, as environmental disturbances influence self-organising societies. In this chapter, several approaches, classical (or not), and their extensions, along with purely multi-agent and self-organising ones, are presented and evaluated in the light of certain characteristics such as distribution, decentralisation, locality, etc. We also argue and show that if we introduce self-organisation we have benefits and better results. We then introduce one such self-organising approach and we demonstrate its applicability to the <em>n</em> queens case study.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: csp, self-organisation
</font></blockquote>

</p>

<p><a id="morge11paams"></a>

Morge, M. and Picard, G. (2011).
 Privacy-preserving strategy for negotiating stable, equitable and
  optimal matchings.
 In <em>Advances on Practical Applications of Agents and Multiagent
  Systems, Proc. of the 9th International Conference on Practical Applications
  of Agents and Multi-Agent Systems (PAAMS 11)</em>, Advances in Intelligent and
  Soft-Computing, pages 97--102. Springer.
[&nbsp;<a href="publications/2011_bib.html#morge11paams">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1007/978-3-642-19875-5">DOI</a>&nbsp;| 
<a href="http://www.springerlink.com/content/978-3-642-19874-8#section=867062&amp;amp;page=1&amp;amp;locus=0">http</a>&nbsp;]
<blockquote><font size="-1">
The assignment problem has a wide variety of applications
                  and in particular, it can be applied to any two-sided
                  market. In this paper, we propose a multi-agent framework
                  to distributively solve this kind of assignment problems,
                  by providing agents which negotiate with respect to their
                  preferences. We present here a realisation of the minimal
                  concession strategy. Our realisation of the minimal
                  concession strategy has useful properties: it preserves
                  the privacy and improves the optimality of the solution
                  and the equity amongst the partners.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: social welfare; stable matching; privacy
</font></blockquote>

</p>

<p><a id="picard11roadef"></a>

Picard, G. and Morge, M. (2011).
 Strat&eacute;gie multi-agent pour la n&eacute;gociation d'appariements
  stables, &eacute;quitables et optimaux.
 In <em>12e Congr&egrave;s de la Soci&eacute;t&eacute; Francaise de Recherche
  Op&eacute;rationnelle et d'Aide &agrave; la Decision (ROADEF'11), Saint-Etienne</em>.
[&nbsp;<a href="publications/2011_bib.html#picard11roadef">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/morgepicard11roadef.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Dans cet article, nous proposons un cadre multi-agent pour  r&eacute;soudre de mani&egrave;re distribu&eacute;e des probl&egrave;mes d'appariements stables, gr&acirc;ce &agrave; des agents repr&eacute;sentant les utilisateurs et n&eacute;gociant en fonction de leurs pr&eacute;f&eacute;rences. L'objectif d'une telle proc&eacute;dure est de trouver une affectation qui est optimale. A cette fin, nous pouvons consid&eacute;rer diff&eacute;rentes notions de bien-&ecirc;tre social (utilitaire, par exemple). Dans ce travail, nous proposons Casanova, une m&eacute;thode distribu&eacute;e pour r&eacute;soudre des probl&egrave;mes de mariages stables. Cette strat&eacute;gie pr&eacute;sente des propri&eacute;t&eacute;s int&eacute;ressantes : (i) elle assure la privacit&eacute; puisque les agents ne r&eacute;v&egrave;lent pas leur liste de pr&eacute;f&eacute;rences et (ii) elle am&eacute;liore l'optimalit&eacute; de la solution et l'&eacute;quit&eacute; des partenaires (entre hommes et femmes, par exemple).
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: stable matching ; social welfare ; privacy
</font></blockquote>

</p>

<p><a id="villanueva11roadef"></a>

Villanueva, D., Le&nbsp;Riche, R., Picard, G., and Haftka, R. (2011a).
 A multi-agent system approach to reliability based design
  optimization including future tests.
 In <em>12e Congr&egrave;s de la Soci&eacute;t&eacute; Francaise de Recherche
  Op&eacute;rationnelle et d'Aide &agrave; la Decision (ROADEF'11), Saint-Etienne</em>.
[&nbsp;<a href="publications/2011_bib.html#villanueva11roadef">bib</a>&nbsp;| 
<a href="http://www.emse.fr/~picard/publications/villanueva11roadef.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Due to the nature of the simulation of a future test, this optimization problem can become quite computationally complex. To address this problem, we seek to distribute this problem amongst many agents, which forms multi-agent systems (MAS). We will examine &ldquo;formulation agents&rdquo; where each agent is attached to solving a simplification of the above global reliability based design with future tests. These agents exchange design points and characteristics of the optimization criteria (e.g., safety factors) in an attempt to achieve both agent autonomy and collective increased efficiency.
An application to an integrated thermal protection system (ITPS) is provided.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: mechanical design; csp
</font></blockquote>

</p>