


<p><a id="DBLP:conf/saso/2016"></a>

Cabri, G., Picard, G., and Suri, N., editors (2016).
 <em>10th IEEE International Conference on Self-Adaptive and
  Self-Organizing Systems, SASO 2016, Augsburg, Germany, September 12-16,
  2016</em>. IEEE Computer Society.
[&nbsp;<a href="publications/2016_bib.html#DBLP:conf/saso/2016">bib</a>&nbsp;| 
<a href="http://ieeexplore.ieee.org/xpl/mostRecentIssue.jsp?punumber=7774239">http</a>&nbsp;]

</p>

<p><a id="rust16jfsma"></a>

Rust, P., Picard, G., and Ramparany, F. (2016a).
 Approche DCOP pour r&eacute;soudre des probl&egrave;mes de configuration
  &eacute;conome d'environnements intelligents.
 In <em>24es Journ&eacute;es Francophones sur les Syst&egrave;mes
  Multi-Agents (JFSMA)</em>, pages 65--74. C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2016_bib.html#rust16jfsma">bib</a>&nbsp;| 
<a href="http://www.cepadues.com/livres/jfsma-2016-systemes-multi-agents-simulation-9782364935594.html">.html</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/rust16jfsma-pres.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Nous consid&eacute;rons des environnements dans lesquels des objets intelligents, munis de capacit&eacute;s limit&eacute;es de calcul et de communication doivent coop&eacute;rer pour auto-configurer leur &eacute;tat de mani&egrave;re &eacute;nerg&eacute;tiquement efficace, afin de respecter des besoins utilisateurs. De tels besoins sont exprim&eacute;s comme des r&egrave;gles   de sc&egrave;nes, configur&eacute;es par l'utilisateur via une interface intuitive qui connecte des conditions sur l'&eacute;tat des objets &agrave; des &eacute;tats cibles de l'environnement. Nous traduisons ce probl&egrave;me de configuration d'environnements intelligents en un probl&egrave;me d'optimisation sous contraintes. Afin d'installer distribution, robustesse et ouverture, nous le r&eacute;solvons gr&acirc;ce &agrave; des algorithmes distribu&eacute;s par envois de messages. Nous illustrons notre approche sur un exemple r&eacute;aliste, et &eacute;valuons les performances des protocoles mis en &oelig;uvre dans un environnement simul&eacute;.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: ambient intelligence, optimization, dcop, maxsum, dpop
</font></blockquote>

</p>

<p><a id="gillani16ssdbm"></a>

Gillani, S., Picard, G., and Laforest, F. (2016c).
 SPECTRA: Continuous query processing for RDF graph streams over
  sliding windows.
 In <em>International Conference on Scientific and Statistical
  Database Management (SSDBM'16)</em>. ACM.
[&nbsp;<a href="publications/2016_bib.html#gillani16ssdbm">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1145/2949689.2949701">DOI</a>&nbsp;| 
<a href="http://doi.acm.org/10.1145/2949689.2949701">http</a>&nbsp;]
<blockquote><font size="-1">
Keywords: RDF Graphs, Incremental Stream Processing
</font></blockquote>

</p>

<p><a id="gillani16debs"></a>

Gillani, S., Picard, G., and Laforest, F. (2016a).
 Continuous graph pattern matching over knowledge graph streams.
 In <em>10th ACM International Conference on Distributed and
  Event-Based Systems (DEBS)</em>, pages 214--225. ACM.
[&nbsp;<a href="publications/2016_bib.html#gillani16debs">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1145/2933267.2933306">DOI</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/gillani16debs-pres.pdf">slides</a>&nbsp;| 
<a href="http://doi.acm.org/10.1145/2933267.2933306">http</a>&nbsp;]
<blockquote><font size="-1">
Continuous Graph Pattern Matching (GPM) is an extended version of the traditional GPM that is evaluated over Knowledge Graph (KG) streams. It comes with additional constraints of scalability and near-to-real-time response, and is used in many applications such as real-time knowledge management, social networks and sensor networks. Hence, existing GPM solutions for static KGs are not directly applicable in this setting. 
This paper studies continuous GPM over KG streams for two different executional models: event-based and incremental. We first propose a query-based graph pruning technique to filter the unnecessary triples from a KG event. The pruned events are materialized in a set of vertically partitioned tables. We then use a hybrid join-and-explore technique to further prune and finally match the triples within a KG event. Considering the on-the-fly execution of queries over pruned KG events, we use an automata-based model to guide the join and exploration process. This leads to an index-free solution optimised for streaming environments. Experimental results with both synthetic and real-world datasets confirm that our system outperforms the state-of-the-art solutions by (on average) one to two orders of magnitude; in terms of performance and scalability.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: knowledge graphs, graph pattern matching, graph streams, semantic web, incremental stream processing
</font></blockquote>

</p>

<p><a id="rust16ijcai"></a>

Rust, P., Picard, G., and Ramparany, F. (2016b).
 Using message-passing DCOP algorithms to solve energy-efficient
  smart environment configuration problems.
 In Kambhampati, S., editor, <em>Proceedings of the Twenty-Fifth
  International Joint Conference on Artificial Intelligence (IJCAI-16)</em>, pages
  468--474. AAAI Press.
[&nbsp;<a href="publications/2016_bib.html#rust16ijcai">bib</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/rust16ijcai-pres.pdf">slides</a>&nbsp;| 
<a href="http://www.ijcai.org/Proceedings/2016/">http</a>&nbsp;| 
<a href="http://www.ijcai.org/Proceedings/16/Papers/073.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
We consider environments, like private houses, in which smart devices equipped with limited communication and computation capabilities have to cooperate to self-configure their state in an energy-efficient manner, as to meet user-defined requirements. Such requirements are expressed as scene rules, configured by the user using an intuitive interface that connects conditions on sensors' and actuators' states and actions on actuators. We translate this smart environment configuration problem into a constraint optimization problem. As to install distributiveness, robustness, and openness, we solve it using distributed message-passing algorithms. We illustrate our approach through a running example, and evaluate the performances of the implemented protocols on a simulated realistic environment.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: ambient intelligence, optimization, dcop, maxsum, dpop
</font></blockquote>

</p>

<p><a id="galland16ria"></a>

Galland, S., Balbo, F., Gaud, N., Rodr&iacute;guez, S., Picard, G., and Boissier,
  O. (2016).
 Environnement multidimensionnel pour contextualiser les interactions
  des agents dans le cadre de la mod&eacute;lisation du traffic routier urbain.
 <em>Revue d'Intelligence Artificielle</em>, 30(1-2):81--108.
[&nbsp;<a href="publications/2016_bib.html#galland16ria">bib</a>&nbsp;| 
<a href="http://dx.doi.org/doi:10.3166/RIA.30.81-108">DOI</a>&nbsp;]
<blockquote><font size="-1">
L'environnement, en tant qu'espace partag&eacute; entre agents, est un &eacute;l&eacute;ment essentiel des syst&egrave;mes multiagents (SMA). Selon les syst&egrave;mes, il existe diff&eacute;rentes classes de mod&egrave;les d'environnement. Il est qualifi&eacute; de physique ou communicationnel selon que les agents interagissent par des actions situ&eacute;es ou des &eacute;changes de messages, mais &eacute;galement de social si un mod&egrave;le social r&eacute;git les interactions. Chacune de ces classes est d&eacute;clinable en dimensions dot&eacute;es chacune de son propre mod&egrave;le. Pour un syst&egrave;me complexe dans lequel diff&eacute;rentes dimensions doivent &ecirc;tre combin&eacute;es, il n'existe que des solutions ad hoc pour obtenir un mod&egrave;le d'environnement global. La cons&eacute;quence est la r&eacute;utilisabilit&eacute; et la modularit&eacute; limit&eacute;e des mod&egrave;les d'environnement. Une alternative usuelle est de consid&eacute;rer l'environnement comme la juxtaposition de ses dimensions et faire de l'agent le lieu de jonction et de combinaison des informations v&eacute;hicul&eacute;es dans ces dimensions. Ce choix de conception accentue la complexit&eacute; des agents et rend d&eacute;pendante de ces derniers la gestion des interactions entre dimensions. Enfin, la mise en &oelig;uvre d'interactions contextuelles, c-&agrave;-d. contraintes par des r&egrave;gles du SMA, impose une gestion des interactions ind&eacute;pendante des agents. Dans cet article, nous proposons un mod&egrave;le unifi&eacute; assurant la combinaison de dimensions pour la mise en &oelig;uvre d'interactions contextualis&eacute;es entre agents. Ce mod&egrave;le est d&eacute;velopp&eacute; avec le langage multiagent SARL. Nous illustrons cette proposition par une application de simulation de trafic routier dans la ville de Belfort.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: traffic, Multi-Agent Systems, Environment modeling, Programming languages for agents and multi-agent systems
</font></blockquote>

</p>

<p><a id="gillani16graphq"></a>

Gillani, S., Picard, G., and Laforest, F. (2016b).
 DIONYSUS: Towards query-aware distributed processing of RDF graph
  streams.
 In <em>Fifth International Workshop on Querying Graph Structured
  Data (GraphQ'16) at EDBT/ICDT 2016 Joint Conference</em>.
[&nbsp;<a href="publications/2016_bib.html#gillani16graphq">bib</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/gillani16graphq-pres.pdf">slides</a>&nbsp;| 
<a href="http://ceur-ws.org/Vol-1558/paper22.pdf">.pdf</a>&nbsp;| 
<a href="http://ceur-ws.org/Vol-1558/paper22.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Arguably, the most significant obstacle to handle the emerging application's data deluge is to design a system that addresses the challenges for big data's volume, velocity and variety. Work in RDF stream processing (RSP) systems partly addresses the challenge of variety by promoting the RDF model. However, challenges like volume, velocity are overlooked by existing approaches. These challenges demand optimised combination of scale-out and scaleup solutions. Furthermore, various other requirements for RSP systems, such as an efficient integration of distributed stream sources, storage of historical streams and their analysis, and integration of stateful operators to support complex event processing over streams are far from being addressed in an efficient way. Our vision is to design a general purpose RDF graph streaming system, which will be able to cope with distributed streams and shares local optimising strategies to allow different kinds of queries (analytical, streaming, sequence-based) through one query interface. The proposed system will offer a black-box solution that will allow analysts to tap in the goldmine of massive RDF graph streams. We consider the challenges and opportunities associated in designing such system, introduce our approaches to these topics, and discuss the components of our envisioned system.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: semantic web,graph pattern matching, complex event processing
</font></blockquote>

</p>