


<p><a id="picard19imt"></a>

Picard, G., Rust, P., and Ramparany, F. (2019).
 Coordination et r&eacute;silience optimales d'objets intelligents.
 In <em>Un &eacute;tat des lieux sur les activit&eacute;s de recherche sur
  l'intelligence artificielle dans les &eacute;coles de l'IMT</em>.
 Poster.
[&nbsp;<a href="publications/2019_bib.html#picard19imt">bib</a>&nbsp;| 
<a href="https://hal-emse.ccsd.cnrs.fr/emse-02102291">http</a>&nbsp;| 
<a href="https://hal-emse.ccsd.cnrs.fr/emse-02102291/file/poster009t.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Keywords: DCOP; Resilience; Adaptation; pyDCOP
</font></blockquote>

</p>

<p><a id="jfsma19resilience"></a>

Rust, P., Picard, G., and Ramparany, F. (2019c).
 R&eacute;silience et auto-r&eacute;paration de processus de d&eacute;cisions
  multi-agents.
 In <em>Journ&eacute;es Francophones sur les Syst&egrave;mes Multi-Agents</em>.
  C&eacute;padu&egrave;s.
[&nbsp;<a href="publications/2019_bib.html#jfsma19resilience">bib</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/jfsma19resilience-pres.pdf">slides</a>&nbsp;| 
<a href="https://www.cepadues.com/livres/JFSMA-2019.-Systèmes-distribués,-embarqués-et-diffus-9782364937192.html">.html</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/jfsma19resilience.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Nous d&eacute;finissons ici la notion de distribution <em>k</em>-r&eacute;siliente de graphes de calculs en support aux d&eacute;cisions d'agents op&eacute;r&eacute;es sur des syst&egrave;mes physiques et dynamiques. Nous proposons une m&eacute;thode auto-organis&eacute;e, DRPM[MGM-2], pour r&eacute;parer la distribution des calculs afin d'assurer que le syst&egrave;me effectue encore les d&eacute;cisions collectives suite &agrave; la disparition d'agents, gr&acirc;ce au d&eacute;ploiement de r&eacute;plicas de calculs. Nous nous int&eacute;ressons particuli&egrave;rement &agrave; la r&eacute;paration de processus d'optimisation sous contraintes distribu&eacute;e, o&ugrave; les calculs sont des variables de d&eacute;cision ou des contraintes distribu&eacute;es sur l'ensemble des agents. Nous &eacute;valuons exp&eacute;rimentalement les performances de notre m&eacute;thode de r&eacute;paration sur diff&eacute;rentes topologie de syst&egrave;mes multi-agents op&eacute;rant des algorithmes (Max-Sum ou A-DSA) pour r&eacute;soudre des DCOP classiques (al&eacute;atoire, coloration de graphe, Ising) alors que des agents disparaissent.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: DCOP; Resilience; Adaptation, MGM-2, A-DSA; Max-Sum
</font></blockquote>

</p>

<p><a id="rust19optmasdemo"></a>

Rust, P., Picard, G., and Ramparany, F. (2019b).
 pyDCOP, a DCOP library for IoT and dynamic systems.
 In <em>International Workshop on Optimisation in Multi-Agent Systems
  (OptMAS@AAMAS 2019)</em>.
[&nbsp;<a href="publications/2019_bib.html#rust19optmasdemo">bib</a>&nbsp;| 
<a href="http://gauthier-picard.info/publications/rust19optmasdemo.pdf">slides</a>&nbsp;| 
<a href="https://www2.isye.gatech.edu/~fferdinando3/cfp/OPTMAS19/papers/paper_13.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Keywords: DCOP, replication, resilience, Max-Sum, DBA, MGM
</font></blockquote>

</p>

<p><a id="rust19aamas"></a>

Rust, P., Picard, G., and Ramparany, F. (2019a).
 Installing resilience in distributed constraint optimization operated
  by physical multi-agent systems.
 In <em>Autonomous Agents and Multiagent Systems (AAMAS)</em>, pages
  2177--2179. International Foundation for Autonomous Agents and Multiagent
  Systems.
[&nbsp;<a href="publications/2019_bib.html#rust19aamas">bib</a>&nbsp;| 
<a href="http://www.ifaamas.org/Proceedings/aamas2019/pdfs/p2177.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Keywords: DCOP; Resilience; Adaptation, MGM-2, A-DSA; Max-Sum
</font></blockquote>

</p>

<p><a id="pham19tnsm"></a>

Pham Tran&nbsp;Anh, Q., Singh, K., Bradai, A., Picard, G., and Riggio, R. (2019).
 Adaptive allocation algorithms for service function chains: Single
  and multi-domain orchestration.
 <em>IEEE Transactions on Network and Service Management</em>,
  16(1):98--112.
[&nbsp;<a href="publications/2019_bib.html#pham19tnsm">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.1109/TNSM.2018.2876623">DOI</a>&nbsp;| 
<a href="https://ieeexplore.ieee.org/document/8494813">http</a>&nbsp;]
<blockquote><font size="-1">
Keywords: Network function virtualization; Service function chaining; Multi-domain orchestration; Distributed optimization
</font></blockquote>

</p>

<p><a id="gillani19swj"></a>

Gillani, S., Zimmermann, A., Picard, G., and Laforest, F. (2019).
 A query language for semantic complex event processing: Syntax,
  semantics and implementation.
 <em>Semantic Web Journal</em>, 10(1):53--93.
[&nbsp;<a href="publications/2019_bib.html#gillani19swj">bib</a>&nbsp;| 
<a href="http://dx.doi.org/10.3233/SW-180313">DOI</a>&nbsp;| 
<a href="http://www.semantic-web-journal.net/system/files/swj1845.pdf">.pdf</a>&nbsp;]
<blockquote><font size="-1">
Today most applications on the Web and in enterprises produce data in a continuous manner under the form of streams, which have to be handled by Data Stream Management Systems (DSMSs) and Complex Event Processing (CEP) systems. The Semantics Web, through its standards and technologies, is in constant pursue to provide solutions for such paradigms while employing the RDF data model. The integration of Semantic Web technologies in this context can handle the heterogeneity, integration and interpretation of data streams at semantic level. In this paper, we propose a new query language, called SPAseq, that extends SPARQL with new Semantic Complex Event Processing (SCEP) operators that can be evaluated over RDF graph-based events. The novelties of SPAseq includes (i) the expressibility of temporal operators such as Kleene+, conjunction, disjunction and event selection strategies, and (ii) the support for multiple heterogeneous streams. SPAseq not only enjoys good expressiveness but also uses a non-deterministic automata (NFA) model for an efficient evaluation of the SPAseq queries. We provide the syntax and semantics of SPAseq and based on this, we implement a query engine that employs NFA to evaluate these operators in an optimised manner. Moreover, we also present an experimental evaluation of its performance, showing that it improves over state-of-the-art approaches.
</font></blockquote>
<p><blockquote><font size="-1">
Keywords: Complex Event Processing, Query Language, Semantic Web, SPARQL, RDF streams, Automata Model, Query Optimisation
</font></blockquote>

</p>